{
  "https://taurbull.com/products/dry-aged-burger-patties-black-angus-freiland": {
    "basic_info": {
      "name": "Burger Patties",
      "full_name": "Burger Patties",
      "price": "€5,70",
      "special_offer": "spare €2,40",
      "description": "Premium Black Angus Burger Patties: 100% Dry Aged Angus Beef aus Freilandhaltung und Mutterkuhaufzucht. 2x200g tiefgekühlt - 70/30-Mix - 0€ Versand ab 80€"
    },
    "full_text": "100% Dry Aged Black Angus Burger Patties aus Freilandhaltung - 2x200g – Taurbull Zum Inhalt springen Instagram YouTube Instagram YouTube Lieferung zum Wunschtermin - 25% Kennenlernrabatt - 4,99€ Versand, ab 80€ kostenlos Mehr Neukundenrabatt 25% auf deine erste Bestellung Als Kennenlernangebot geben wir jedem Neukunden 25% Rabatt auf die erste Bestellung. Verwende dazu den Code: IAMTAURBULL im Gutscheinfenster beim Checkout. Mehr Home Die Farm Black Angus Rinder Premium Black Angus Steaks Versand Shop Kontakt FAQ Blog Einloggen Suche Suche Abonnieren Notiz Einloggen Home Shop Kontakt FAQ Blog Zurück Die Farm Black Angus Rinder Premium Black Angus Steaks Versand Instagram YouTube Home Alle Produkte Burger Patties Regulärer Preis €7,60 EUR Verkaufspreis €7,60 EUR Regulärer Preis €10,00 spare €2,40 Stückpreis €19,00 / pro kg Größe 2x200g 300g 4x200g Menge Menge verringern für Burger Patties Menge erhöhen für Burger Patties 100% Black Angus Dry Aged Ungewürzt Praktischer 2er Pack Unsere Black Angus Burgerpatties bestehen zu 70/30 aus hochwertigem Rindfleisch und Rinderfett (Beeftallow) und bieten einen intensiven Geschmack. inkl. MwSt. Versand wird beim Checkout berechnet In den Warenkorb legen Bei diesem Artikel handelt es sich um einen wiederkehrenden Kauf oder Kauf mit Zahlungsaufschub. Indem ich fortfahre, stimme ich den Stornierungsrichtlinie zu und autorisiere Sie, meine Zahlungsmethode zu den auf dieser Seite aufgeführten Preisen, in der Häufigkeit und zu den Terminen zu belasten, bis meine Bestellung ausgeführt wurde oder ich, sofern zulässig, storniere. Share Link Riesige Weiden - Frisches Gras - Saftige Kräuter - Natur Pur. Exzellentes Fleisch durch stressfreie Mutterkuhaufzucht und Weidelandhaltung. Premium Burger Pattie vom Black Angus Rind aus Freilandhaltung Hergestellt aus premium Dry Aged Beef Ohne Gewürze für puren Burgergenuss Im praktischen 2er Pack Position des Cuts Bestes Fleisch Unsere Black Angus Burger Patties bestehen aus einer ausgewogenen Mischung von Fleisch und Fett, das hauptsächlich aus dem Schulter- und Brustbereich des Rindes stammt. Diese Bereiche bieten die harmonische Balance zwischen Fleisch und Fett, um saftige und geschmackvolle Patties herzustellen. Beef Marbeling Score 3-4 Marmorierung Die Marmorierung der Burger Patties erreicht einen Beef Marbling Score (BMS) von 3 bis 4. Diese Marmorierung sorgt dafür, dass die Patties beim Grillen oder Braten saftig bleiben und ein intensives, fleischiges Aroma entfalten. Aromatisch und zart Textur und Biss Die Textur der Burger Patties ist zart und saftig, mit einem angenehmen Biss und sie behalten ihre Form beim Grillen oder Braten. Unsere Burger Patties sind nicht gewürzt und deshalb die Grundlage für ehrlichen Burgergenuss der sowohl zart als auch aromatisch ist. Burgerpatties Zubereitungsempfehlungen Kerntemperaturen und Garstufen Kerntemperatur und Garstufen für die perfekten Burger Patties Rare: 48–52 °C . Innen roh und saftig, außen leicht angebraten. Medium Rare: 53–57 °C . Innen zart rosa mit blutigem Kern, außen gut angebraten. Medium: 58–62 °C . Gleichmäßig rosa im Inneren, saftig und durchgegart. Medium Well: 63–68 °C. Fast durchgegart, nur noch ein Hauch von Rosa. Well Done: 69–75 °C. Vollständig durchgegart, kein Rosa mehr. Unsere Besten Links zum Thema Burger Patties Burger Grillen: der perfekte Burger vom Grill in 5 einfachen Schritten - Frank Rub And Smoke 5 Schritte zum perfekten Burger! - Meat´n´Great DER BESTE CHEESEBURGER DER WELT - Klaus Grillt Classic Smash Burger Recipe - certified Angus Beef I Made The Perfect Burger - Joshua Weissmann Das sagen unsere Kunden “ Markus S. Die Black Angus Burger Patties sind der Hammer. Saftig, voller Geschmack und perfekt für meinen Soapestone in meinem Kamado Joe. “ Timo B. Ich habe viele Burger probiert, aber diese Patties toppen alles. Perfekte Textur und intensiver Fleischgeschmack. “ Jens K. Diese Patties sind genau mein Ding. Einfach auf den Grill, ein bisschen Salz & Pfeffer, und sie schmecken wie im Steakhouse. News und Angebote direkt in deine Inbox E-Mail Jederzeit abmeldbar - garantiert kein Spam - versprochen! Menu Menu Home Shop Kontakt FAQ Blog Links Links FAQs Impressum Datenschutz AGB Versandoptionen Widerruf Folge Uns Instagram YouTube Zahlungsarten American Express Apple Pay Google Pay Klarna Maestro Mastercard PayPal Shop Pay Union Pay Visa © 2025, Taurbull Powered by Shopify Leidenschaftlicher Genießer? Hier gibts unsere exklusiven Promotions, Neue Cuts, und limitierte Angebote. Direkt in dein Postfach. Email"
  },
  "https://taurbull.com/products/ribeye-steak-black-angus-dry-aged": {
    "basic_info": {
      "name": "Ribeye Steak",
      "full_name": "Ribeye Steak",
      "price": "€20,70",
      "description": "Black Angus Ribeye Steak, 21 Tage Dry Aged – zart, saftig, aus eigener Mutterkuhaufzucht & Freilandhaltung. Direkt von unserer Farm. Versand gratis ab 80 €."
    },
    "full_text": "Black Angus Ribeye Steak Dry Aged – Entrecôte aus Freilandhaltung – Taurbull Zum Inhalt springen Instagram YouTube Instagram YouTube Lieferung zum Wunschtermin - 25% Kennenlernrabatt - 4,99€ Versand, ab 80€ kostenlos Mehr Neukundenrabatt 25% auf deine erste Bestellung Als Kennenlernangebot geben wir jedem Neukunden 25% Rabatt auf die erste Bestellung. Verwende dazu den Code: IAMTAURBULL im Gutscheinfenster beim Checkout. Mehr Home Die Farm Black Angus Rinder Premium Black Angus Steaks Versand Shop Kontakt FAQ Blog Einloggen Suche Suche Abonnieren Notiz Einloggen Home Shop Kontakt FAQ Blog Zurück Die Farm Black Angus Rinder Premium Black Angus Steaks Versand Instagram YouTube Home Alle Produkte Ribeye Steak Regulärer Preis €20,70 EUR Verkaufspreis €20,70 EUR Regulärer Preis Stückpreis €69,00 / pro kg Größe 300g 350g 400g 520g Menge Menge verringern für Ribeye Steak Menge erhöhen für Ribeye Steak Entrecôte - Zwischenrippenstück 100% Black Angus aus artgerechter Mutterkuhhaltung Freilandaufzucht auf weitläufigen Weiden Natürliche Ernährung mit frischen Gräsern und Kräutern 21 Tage Dry Aged für intensiven Geschmack Fein marmoriert und besonders zart Schockgefrostet für perfekte Konservierung bis zu 12 Monate in der Tiefkühltruhe haltbar Das Ribeye Steak oder auch Entrecôte genannt, gehört zu den beliebtesten Steak-Cuts, bekannt für seine kräftige Marmorierung und den intensiven Geschmack. Dieses Fleisch stammt von unseren Black Angus Rindern, die artgerecht auf weitläufigen Weiden gehalten und ausschließlich mit natürlichen Gräsern und Kräutern gefüttert werden. Highlight: In der aktuellen Charge haben wir das 520g Ribeye als BONE-IN für das perfekte Geschmacks- und Grillerlebnis. Schnell zugreifen, nur noch wenige auf Lager. inkl. MwSt. Versand wird beim Checkout berechnet In den Warenkorb legen Bei diesem Artikel handelt es sich um einen wiederkehrenden Kauf oder Kauf mit Zahlungsaufschub. Indem ich fortfahre, stimme ich den Stornierungsrichtlinie zu und autorisiere Sie, meine Zahlungsmethode zu den auf dieser Seite aufgeführten Preisen, in der Häufigkeit und zu den Terminen zu belasten, bis meine Bestellung ausgeführt wurde oder ich, sofern zulässig, storniere. Share Link Riesige Weiden - Frisches Gras - Saftige Kräuter - Natur Pur. Exzellentes Fleisch durch stressfreie Mutterkuhaufzucht und Weidelandhaltung. Ribeye Steak Position des Cuts Das Ribeye Steak, auch Entrecôte genannt, wird aus dem vorderen Rücken des Rindes geschnitten, genauer gesagt aus dem Bereich der Hochrippe. Dieser Bereich ist bekannt für seine perfekte Balance zwischen Fett und Fleisch, was zu einem saftigen, geschmackvollen Steak führt. Beef Marbeling Score 4-5 Marmorierung Das Ribeye ist eines der am stärksten marmorierten Stücke des Rindes. Der Beef Marbling Score (BMS) für unser Black Angus Ribeye liegt bei 4 bis 5, was für eine starke Marmorierung sorgt, die während des Garens schmilzt und dem Fleisch eine unvergleichliche Saftigkeit und intensiven Geschmack verleiht. Subheading Textur und Biss Das Ribeye hat eine butterweiche Textur, die durch seine intensive Marmorierung verstärkt wird. Der Biss ist angenehm saftig, und die Mischung aus feinem Fett und zartem Fleisch macht es zu einem der begehrtesten Steak-Cuts weltweit. Ideal für Grill und Pfanne, ist es perfekt für Fleischliebhaber, die Wert auf zarten Biss und kräftigen Geschmack legen. Premium Steak vom Black Angus Rind aus Freilandhaltung 28 Tage am Knochen im Dry Aging Verfahren veredelt Preisgekrönte Genetik für weltklasse Marmorierung Ethisch und Moralisch unübertroffener Fleischgenuß Ribeye Steak Zubereitungsempfehlungen Kerntemperatur und Grillmethoden Ribeye Steak Kerntemperatur und Garstufen Rare: 48–52 °C Medium: 58–62 °C Dick geschnitten, direkt scharf anbraten und dann langsam indirekt auf Zieltemperatur ziehen lassen. Ribeye Steak vom Gasgrill Fleisch 1,5 Stunden vor dem Grillen aus dem Kühlschrank nehmen. 15–20 Minuten vor dem Grillen mit Meersalzflocken bestreuen Grill 15 Minuten auf maximale Temperatur vorheizen (mind. 280 °C). Rost mit einer Bürste säubern und mit einer geölten Zwiebel einfetten. Pro Seite 3 Minuten auf jeder Seite grillen. Steak danach auf die obere Ablage des Grills legen, weg von der direkten Hitze. Nur ein Brenner bei niedriger Hitze eingeschaltet lassen. Zieltemperatur 52–54 °C (medium, saftig). Kernthermometer verwenden, um den optimalen Garzeitpunkt nicht zu verpassen. Mindestens 3 Minuten ruhen lassen, damit sich der Fleischsaft gleichmäßig verteilt. Das sagen unsere Kunden “ Frank P. Ich liebe den kräftigen Geschmack beim Black-Angus-Ribeye. Die schöne Fettstruktur sorgt dafür, dass das Fleisch auch bei hoher Hitze zart und saftig bleibt. “ Jonas H. Für mich ist das Ribeye der Inbegriff von Genuss. Gerade bei Black Angus ist das Fleisch besonders fein marmoriert, was den Grillabend zum echten Geschmackserlebnis macht. “ Oliver R. Das Black-Angus-Ribeye überzeugt mich jedes Mal mit seinem intensiven Aroma. Die ausgeprägte Marmorierung macht das Steak super saftig. Unsere Besten Links zum Thema Ribeye Ribeye Steak Guide - The Bearded Butchers Cold Seared - Lan Lam Everything You Should Know About Ribeye Steak - Mashed Steak grillen | Das Ribeye Steak - Sizzle Brothers Steak Grillen: Das perfekte Steak in 7 einfachen Schritten auf dem Gasgrill zubereiten - Frank Rub And Smoke News und Angebote direkt in deine Inbox E-Mail Jederzeit abmeldbar - garantiert kein Spam - versprochen! Menu Menu Home Shop Kontakt FAQ Blog Links Links FAQs Impressum Datenschutz AGB Versandoptionen Widerruf Folge Uns Instagram YouTube Zahlungsarten American Express Apple Pay Google Pay Klarna Maestro Mastercard PayPal Shop Pay Union Pay Visa © 2025, Taurbull Powered by Shopify Leidenschaftlicher Genießer? Hier gibts unsere exklusiven Promotions, Neue Cuts, und limitierte Angebote. Direkt in dein Postfach. Email"
  },
  "https://taurbull.com/products/short-ribs-black-angus-dry-aged": {
    "basic_info": {
      "name": "Beef Ribs",
      "full_name": "Beef Ribs",
      "price": "€17,50",
      "description": "Beef Ribs - Short Ribs - Querrippe mit Knochen - saftig, zart & voller Aroma. Perfekt für Low & Slow. 21 Tage Dry Aged. Maximaler Geschmack. 0€ Versand ab 80 €."
    },
    "full_text": "Short Ribs – Black Angus Beef Ribs | 21 Tage Dry Aged – Taurbull Zum Inhalt springen Instagram YouTube Instagram YouTube Lieferung zum Wunschtermin - 25% Kennenlernrabatt - 4,99€ Versand, ab 80€ kostenlos Mehr Neukundenrabatt 25% auf deine erste Bestellung Als Kennenlernangebot geben wir jedem Neukunden 25% Rabatt auf die erste Bestellung. Verwende dazu den Code: IAMTAURBULL im Gutscheinfenster beim Checkout. Mehr Home Die Farm Black Angus Rinder Premium Black Angus Steaks Versand Shop Kontakt FAQ Blog Einloggen Suche Suche Abonnieren Notiz Einloggen Home Shop Kontakt FAQ Blog Zurück Die Farm Black Angus Rinder Premium Black Angus Steaks Versand Instagram YouTube Home Alle Produkte Beef Ribs Regulärer Preis €17,50 EUR Verkaufspreis €17,50 EUR Regulärer Preis Stückpreis €25,00 / pro kg Größe 700g 900g 1.100g 1.800g Menge Menge verringern für Beef Ribs Menge erhöhen für Beef Ribs Beef Ribs - Short Ribs - Querrippe mit Knochen 100% Black Angus aus artgerechter Mutterkuhhaltung Freilandaufzucht auf weitläufigen Weiden Natürliche Ernährung mit frischen Gräsern und Kräutern 21 Tage Dry Aged für intensiven Geschmack Saftig, zart und voller Geschmack Ideal zum Smoken oder langsamen Garen Schockgefrostet für perfekte Konservierung bis zu 12 Monate in der Tiefkühltruhe haltbar Die Black Angus Beef Ribs (Short Ribs/Querrippe mit Knochen) sind ein wahrer Leckerbissen für BBQ- und Smoker-Fans. Dieser Cut aus dem Brustbereich der Rinder ist bekannt für seine kräftige Marmorierung und sein intensives Aroma. Die Beef Ribs werden langsam gegart oder gesmoked und sind dabei unglaublich saftig und zart. inkl. MwSt. Versand wird beim Checkout berechnet In den Warenkorb legen Bei diesem Artikel handelt es sich um einen wiederkehrenden Kauf oder Kauf mit Zahlungsaufschub. Indem ich fortfahre, stimme ich den Stornierungsrichtlinie zu und autorisiere Sie, meine Zahlungsmethode zu den auf dieser Seite aufgeführten Preisen, in der Häufigkeit und zu den Terminen zu belasten, bis meine Bestellung ausgeführt wurde oder ich, sofern zulässig, storniere. Share Link Riesige Weiden - Frisches Gras - Saftige Kräuter - Natur Pur. Exzellentes Fleisch durch stressfreie Mutterkuhaufzucht und Weidelandhaltung. Beef (short) Ribs Position des Cuts Die Beef Ribs, auch bekannt als Short Ribs, stammen aus dem Brustbereich des Rindes. Dieser Cut umfasst die kurzen Rippen, die sich durch eine kräftige Struktur und einen hohen Fettanteil auszeichnen, der für perfekte Marmorierung und reichhaltigen Geschmack sorgt. Beef Marbeling Score 4-5 Marmorierung Die Short Ribs haben eine intensive Marmorierung, die einen Beef Marbling Score (BMS) von 4 bis 5 erreicht. Diese Marmorierung sorgt beim langsamen Garen dafür, dass das Fleisch besonders saftig bleibt und tiefes, intensives Aroma entwickelt. Fällt vom Knochen Textur und Biss Die Textur der Beef Ribs ist fest und faserig, aber durch langsames Schmoren oder Smoken wird das Fleisch butterzart und fällt praktisch vom Knochen. Der Biss ist zart und vollmundig, mit einem kräftigen, fleischigen Geschmack, ideal für Barbecue und Schmorgerichte. Perfekt für Low & Slow BBQ Einfache Zubereitung mit hervorragendem Geschmackserlebnis Vielseitig einsetzbare ls Snack, Hauptgericht oder Füllung Großartiges Preis/Leistungs-Verhältnis Beef Ribs Zubereitungsempfehlungen Kerntemperatur und Grillmethoden Beef Ribs Kerntemperatur 95°C Kerntemperatur ist die bevorzugte Garstufe für Beef Ribs. Bei dieser Temperatur zerschmilzt das Kollagen und macht die Beef Ribs butterzart, so, dass das Fleisch vom Knochen fällt. Beef Short Ribs im Smoker und Kamado Keramikgrill Fokus auf einfache Schritte, um butterweiche und aromatische Ribs zuzubereiten. Silberhaut bleibt dran, um das Fleisch zusammenzuhalten. Oberes Fett leicht eingeschnitten, damit die Gewürze besser eindringen. Fleisch großzügig von allen Seiten mit rub deiner Wahl würzen und etwa 10 Minuten ruhen lassen. Smoker wird auf 140–190 °C vorgeheizt, dann auf etwa 140 °C stabilisiert. Räucherholz: Hickory oder Buche für intensiven Rauchgeschmack. Ribs werden 3 Stunden geräuchert. Nach 3 Stunden: Ribs in einen Behälter legen oder in Butcherpaper/Alufolie einwickeln. Selbstgemachter Rinderfond, Cola oder Apfelsaft zugeben. gut verschließen/einwickeln und weitere 2 Stunden bei 140 °C dämpfen. Nach 2 Stunden Temperatur reduzieren (60–70 °C) und die Ribs 1 Stunde ruhen lassen. Vor dem Servieren 10 Minuten offen stehen lassen, damit sie leicht abkühlen und überschüssige Feuchtigkeit verdampft. Wir empfehlen immer ein Thermometer zu benutzen - das macht vieles einfacher und es gibt keine bösen Überraschungen. Beef Ribs vom Gasgrill Eine einfache Methode, die auch zu Hause reproduziert werden kann. Die Fettschicht der Beef Ribs kann optional entfernt werden. Wichtig ist, die Membran an der Unterseite der Ribs zu entfernen oder einzuritzen. Gewürzt wird mit einem Rub nach Wahl: klassisch Salz, Pfeffer und Knoblauch. Alternativ: BBQ-Gewürzmischungen. Dei Beef Ribs werden mit Räucherchips (in Alufolien-Päckchen oder Räucherboxen) geräuchert. Grilltemperatur: 150–180 °C. Räucherphase: 2–3 Stunden, je nach gewünschtem Rauchgeschmack. Räucherchips werden stündlich nachgelegt. Dämpfphase: Nach 2-3 Räicherzeit die Beef Ribs in Butcher Paper oder Alufolie einwickeln. Optional: Flüssigkeit wie Apfelsaft oder Cola hinzufügen, um die Ribs noch saftiger zu machen. Weitere 2–3 Stunden auf dem Grill lassen, bis eine Kerntemperatur von 95–96 °C erreicht ist. Temperatur reduzieren (unter 100 °C) und die Ribs ruhen lassen, damit das Kollagen im Fleisch sich zersetzen kann. Optional: Mit BBQ-Glaze bestreichen und karamellisieren lassen. Wir empfehlen immer ein Thermometer zu benutzen - das macht vieles einfacher und es gibt keine bösen Überraschungen. Beef Ribs vom Holzkohlegrill Richte eine indirekte Zone ein, indem du die Kohlen auf eine Seite des Grills schiebst. Halte die Grilltemperatur bei 120–140 °C . Für ein Räucherarmoma und einen perfekten Smokering kannst du Räucherchips (z. B. Hickory) hinzufügen. Die Ribs trocken tupfen, leicht mit Öl bestreichen und mit Gewürzen einreiben. Für mehrere Stunden (mind. 3-4) indirekt grillen, bis die Kerntemperatur bei etwa 95 °C liegt. Optional: Mit BBQ-Sauce glasieren und mindestens 30 Minuten in einer Truhe o.Ä. ruhen lassen. Wir empfehlen immer ein Thermometer zu benutzen - das macht vieles einfacher und es gibt keine bösen Überraschungen Beef Ribs aus dem Ofen Backofen auf 120 °C vorheizen. Ribs in eine Ofenform legen und mit Alufolie abdecken. Für 3 Stunden bei 120 °C garen. Alufolie entfernen und mit BBQ-Sauce bestreichen. Für weitere 30 Minuten bei 180 °C offen braten, bis eine knusprige Kruste entsteht. Ziel-Kerntemperatur: 95 °C . Aus dem Ofen nehmen und mind. 30 Minuten ruhen lassen. Wir empfehlen immer ein Thermometer zu benutzen - das macht vieles einfacher und es gibt keine bösen Überraschungen. Unsere Besten Links zum Thema Beef Ribs What are Beef Ribs and What are the Different Styles | The Bearded Butchers BEEF SHORT RIBS - Meat´n´Great BEEF SHORT RIBS - Butterweich und saftig! - Oliver Sievers Beef Ribs - Pitmaster X Slow Cooking Beef Short Ribs | Gordon Ramsay Das sagen unsere Kunden “ Markus S. Die Beef Ribs von TAURBULL sind ein Traum für jeden Fleischliebhaber. Ich habe sie im Smoker zubereitet, und das Ergebnis war überwältigend. “ Sven K. Das völlig irre Verhältnis von Fleisch und Fett sorgt für ein intensives, saftiges Aroma, das es so nur noch beim Brisket gibt. “ Stephan P. Die Marmorierung ist erstklassig, und das Fleisch hat nach dem Smoken eine Textur, die auf der Zunge zergeht. News und Angebote direkt in deine Inbox E-Mail Jederzeit abmeldbar - garantiert kein Spam - versprochen! Menu Menu Home Shop Kontakt FAQ Blog Links Links FAQs Impressum Datenschutz AGB Versandoptionen Widerruf Folge Uns Instagram YouTube Zahlungsarten American Express Apple Pay Google Pay Klarna Maestro Mastercard PayPal Shop Pay Union Pay Visa © 2025, Taurbull Powered by Shopify Leidenschaftlicher Genießer? Hier gibts unsere exklusiven Promotions, Neue Cuts, und limitierte Angebote. Direkt in dein Postfach. Email"
  }
}